      
        function filterMasters(category) {
            document.querySelectorAll(".master-card").forEach(card => {
                const show =
                    category === "all" ||
                    card.dataset.category === category;
                card.style.display = show ? "" : "none";
            });
        }


        const masters = [
            {
                name: "Володя",
                profession: "Сантехнік",
                category: "plumber",
                rating: 4.9,
                reviews: 8,
                experience: 12,
                city: "Покров",
                phone: "+380508434698",
                description: "Водопостачання: Прокладання труб, встановлення лічильників, фільтрів, запірної арматури. Каналізація: Монтаж внутрішніх і зовнішніх систем зливу. Опалення: Встановлення радіаторів, теплої підлоги, циркуляційних насосів, котлів та розширювальних баків. Монтаж обладнання: Підключення ванн, душових кабін, унітазів, умивальників, змішувачів, бойлерів та пральних машин." 
            },


           {
                name: "Олексій",
                profession: "Електрик",
                category: "electrician",
                rating: 4.8,
                reviews: 9,
                experience: 10,
                city: "Покров",
                phone: "+380956617006",
                description: "Заміна та встановлення: Монтаж розеток, вимикачів, датчиків руху та освітлювальних приладів (люстри, бра, точкові світильники). Підключення техніки: Безпечне приєднання варильних поверхонь, духових шаф, бойлерів та пральних машин. Монтаж електропроводки: Повна або часткова заміна кабелів у квартирі, будинку чи офісі (здійснюється відповідно до плану навантажень). Робота зі щитовими: Збирання електрощитів, встановлення автоматичних вимикачів (автоматів), пристроїв захисного відключення (ПЗВ) та стабілізаторів напруги"

            },

            {
                name: "Володимир",
                profession: "Будівельник",
                category: "builder",
                rating: 4.9,
                reviews: 12,
                experience: 11,
                city: "Покров",
                phone: "+380964851722",
                description: "Фундаментні роботи: влаштування фундаментів різних типів (стрічковий, монолітний, плити), гідроізоляція та утеплення.Зведення конструкцій: кладка стін і перегородок (цегла, газоблок), монтаж плит перекриття, заливка армопоясів.Покрівельні роботи: монтаж кроквяної системи, укладання покрівельного матеріалу (металочерепиця, профнастил тощо) та утеплення даху.Фасадні роботи: утеплення фасадів (мінеральна вата, пінопласт), декоративне оздоблення (короїд, сайдинг), монтаж водостічних систем.Внутрішні оздоблювальні роботи: штукатурка, шпаклівка, гіпсокартонні конструкції, укладання плитки та підлогових покриттів, малярні роботи.Інженерні мережі: розведення електрики, монтаж систем опалення, водопостачання та каналізації"
            },


            {
                name: "Володимир",
                profession: "Зварювальник",
                category: "welder",
                rating: 4.7,
                reviews: 8,
                experience: 8,
                city: "Покров",
                phone: "+380508434698",
                description: "Монтаж: збирання каркасів, ангарів, сходів та балконів на об'єкті. Створення парканів, навісів, альтанок та решіток."
            },

            {
                name: "Станіcлав",
                profession: "Майстер на годину",
                category: "handyman",
                rating: 4.8,
                reviews: 13,
                experience: 21,
                city: "Покров",
                phone: "+380976944195",
                description: "Дверні та замкові роботи:Встановлення або заміна замків, личинок, ручок на вхідних чи міжкімнатних дверях.Электрика: замена или ремонт розеток, выключателей, установка люстр, бра, подключение бытовой техники.Сантехника: устранение протечек, замена смесителей, сифонов, подключение стиральных машин, прочистка засоров.Сборка и ремонт мебели: сборка шкафов, кроватей, столов, комодов, регулировка фасадов, замена фурнитуры.Мелкий монтаж: навешивание зеркал, полок, картин, телевизоров, установка карнизов, жалюзи, монтаж плинтусов."
           },

           
            {
                name: "Євгеній",
                profession: "Маляр",
                category: "painter",
                rating: 4.8,
                reviews: 16,
                experience: 7,
                city: "Покров",
                phone: "+380972859328",
                description: "Підготовка поверхонь: очищення від старих матеріалів, ґрунтування.Чорнова обробка: шпаклювання для усунення дефектів, нанесення армуючої сітки та вирівнювання.Фінішне оздоблення: нанесення декоративної штукатурки, фарбування різними складами (водоемульсійними, акриловими тощо) або наклеювання шпалер"
            },

             {
                name: "Володимир",
                profession: "Плиточник",
                category: "tiler",
                rating: 4.7,
                reviews: 9,
                experience: 11,
                city: "Покров",
                phone: "+380508434698",
                description: "Підготовчі роботи: демонтаж старої плитки, вирівнювання стін або заливка стяжки підлоги, ґрунтування, а також монтаж гідроізоляції для вологих зон.Безпосереднє укладання: монтаж плитки будь-якої складності (пряме, діагональне, укладання «ялинкою» або модульних елементів, як-от гексагони).Додаткові послуги: точна різка плитки, шліфування кромок під кутом 45° (запив під кут), висвердлювання отворів під розетки та комунікації, монтаж декоративних елементів (фризи, бордюри).Затирання швів: фінішна обробка швів цементними або епоксидними сумішами, герметизація примикань (ванни, піддони) силіконом.Ціни на послуги формуються за квадратний метр (укладання) або за погонний метр (різка, шліфування, встановлення куточків)."
            },

            {
                name: "Володя",
                profession: "Майстер з монтажу систем опалення",
                category: "heating-installer",
                rating: 4.8,
                reviews: 17,
                experience: 7,
                city: "Покров",
                phone: "+380964851722",
                description: "Гідравлічний розрахунок (вибір діаметрів труб, налаштування тиску та підбір циркуляційних насосів).Розведення трубопроводу (металопластик, поліпропілен, зшитий поліетилен).Встановлення радіаторів, конвекторів (у тому числі внутрішньопідлогових).Монтаж систем теплої підлоги (водяної).Встановлення запірної арматури, терморегуляторів та систем автоматики."
            },

            {
                name: "Володимир",
                profession: "Майстер з монтажу вікон",
                category: "window-installer",
                rating: 4.9,
                reviews: 6,
                experience: 10,
                city: "Покров",
                phone: "+380508434698",
                description: "Підготовчі роботи: Виїзд на об'єкт, зняття точних розмірів, консультація щодо вибору профілю та матеріалів.Демонтаж: Обережне видалення старих рам та підвіконь без руйнування стін.Підготовка отвору: Очищення від пилу та сміття, обробка поверхонь.Монтаж рами: Фіксація вікна в отворі за допомогою анкерів та дюбелів із суворим контролем рівня.Герметизація та теплоізоляція: Заповнення монтажних швів піною.Встановлення комплектуючих: Фіксація відливів, підвіконь, склопакетів та стулок.Регулювання: Налаштування фурнітури (цапф, петель) для плавного відкривання та щільного притиску"
            },

             {
                name: "Станіслав",
                profession: "Майстер з монтажу дверей",
                category: "door-installer",
                rating: 5.0,
                reviews: 19,
                experience: 21,
                city: "Покров",
                phone: "+380976944195",
                description: "Підготовчі роботи: Проведення точних вимірів, оцінка рівня стін та підлоги, допомога у виборі матеріалів та підготовка дверного отвору.Монтаж конструкції: Складання рами, надійна фіксація дверної коробки в отворі за допомогою монтажної піни та кріплень.Робота з фурнітурою: Точна врізка петель, замків, клямок, встановлення ручок та дверних доводчиків.Оздоблення: Встановлення доборів (для широких стін), монтаж лиштви та герметизація щілин.Налаштування та перевірка: Регулювання механізмів для плавного відкривання/закривання без тертя чи провисань"
            },

            {
                name: "Влад",
                profession: "Натяжна стеля",
                category: "stretch-ceilings",
                rating: 4.9,
                reviews: 11,
                experience: 7,
                city: "Покров",
                phone: "+380687611313",
                description: "виїзд на замір: Фахівець оцінює площу, визначає кути та перепади висот, допомагає обрати фактуру (глянець, мат, сатин).Консультація та розрахунок: Складання кошторису з урахуванням матеріалу (ПВХ-плівка чи тканина) та складності конструкції.Розкрій полотна: Підготовка матеріалу за індивідуальними розмірами приміщення на спеціальному виробництві.2. Безпосередній монтажМонтаж профілю (багета): Кріплення алюмінієвого або пластикового каркаса по периметру стін.Закладні під освітлення: Встановлення платформ під люстри, точкові світильники чи монтаж прихованих карнизів.Прогрів та натяжка полотна: Використання теплової гармати для розігріву плівки та її натягнення на профіль (для ПВХ).Монтаж освітлення: Вирізання отворів під світильники, їх підключення та ізоляція.3. Фінішні роботиМаскування щілин: Встановлення декоративної стрічки (заглушки) по периметру, яка приховує технічний зазор між стелею та стіною."
            },

            {
                name: "Женя",
                profession: "Майстер з внутрішнього оздоблення",
                category: "interior-finisher",
                rating: 4.8,
                reviews: 9,
                experience: 11,
                city: "Покров",
                phone: "+380972859328",
                description: "Оздоблення стін та стель: Фарбування, обклеювання шпалерами, нанесення декоративної штукатурки.Роботи з підлоговим покриттям: Укладання ламінату, паркетної дошки, вінілової плитки чи лінолеуму, монтаж плінтусів."
            },
        ];

         //Функція сортування майстрів по рейтингу
        masters.sort((a, b) => b.rating - a.rating);

        //місцеве сховище дл фаворитів
        let favorites = JSON.parse(
            localStorage.getItem("favorites")
        ) || [];
        

        const masterGrid = document.getElementById("masterGrid");

        function renderMasters() {

            masterGrid.innerHTML = "";

            masters.forEach(master => {

                masterGrid.innerHTML += `
                    <div class="master-card"
                        data-category="${master.category}">

                        <img src="${master.photo}"
                            alt="${master.name}"
                            onerror="this.onerror=null; this.src='images/default.jpeg';"> 
                            
                        <h3>${master.name}</h3>

                        <p>🛠️${master.profession}</p>
                        <p class="master-description">📜${master.description || 'Надання професійних послуг в нашому місті'}</p>

                        <p>⭐${master.rating}
                        (${master.reviews} відгуків)
                        </p>

                        <p>
                            🏆${master.experience} років досвіду
                        </p>

                        <p>📍${master.city}</p>
                            
                        <a class="call-btn"
                            href="tel:${master.phone}">
                            📞Подзвонити
                        </a>

                        <button
                            class="favorite-btn"
                            data-phone="${master.phone}"
                            onclick="toggleFavorite('${master.phone}')">
                            ⭐ В обране

                        </button>
                        

                            
                    </div>
                `; 
            });

            renderFavorites();
        }
        //onerror="this.onerror=null; this.src='images/default.jpeg';" - це атрибут зображення, який забезпечує заміну зображення на "images/default.jpeg" у випадку помилки завантаження (наприклад, якщо вказане зображення не існує або недоступне). Це дозволяє уникнути відображення порожнього місця або помилки замість зображення майстра.




        renderMasters(); //рендерить список майстрів -const masterGrid = document.getElementById("masterGrid");
        
        

                //Функція додавання та видалення майстрів з фаворитів
        function toggleFavorite(masterPhone) {
            if (favorites.includes(masterPhone)) {
                favorites = favorites.filter(
                item => item !== masterPhone
            );
            } else {
                favorites.push(masterPhone);
            }
            localStorage.setItem(
                "favorites",
                JSON.stringify(favorites)
            );
            renderFavorites();
        }


        function renderFavorites() {

            document
                .querySelectorAll(".favorite-btn")
                .forEach(btn => {
                    const phone = btn.dataset.phone;

                    if (favorites.includes(phone)) {

                        btn.textContent = "❤️ В обраному";
                        btn.classList.add("active");

                    } else {
                        btn.textContent = "⭐ В обране";
                        btn.classList.remove("active");
                    }
                });
        }
                                
                                           




            //Функція пошуку
        function searchMaster() {

            const input = document
            .getElementById("searchInput")
            .value
            .toLowerCase();

            const cards = document.querySelectorAll(".master-card");

            cards.forEach(card => {

                const title = card.innerText.toLowerCase();

                if (title.includes(input)) {
                    card.style.display = "";
                } else {
                    card.style.display = "none"
                }
            });
        }







               
           //кнопка повернення догори    
        const btn = document.getElementById("scrollToTopBtn");       
               
               //показує кнопку, коли юзер прокручує сторінку до низу
        window.addEventListener("scroll", () => {
            btn.classList.toggle(
                "show",
                window.scrollY > 300
            );
        });
            

        
                //прокручує сторінку плавно до самого верху при натисканні
        btn.addEventListener("click", () => {
            window.scrollTo({
                top: 0,
                behavior: "smooth"//забезпечує плавний скролінг
            });
        });

    
        
        
        
     
            
     
            
            
